tap 'homebrew/fuse'
tap 'homebrew/dupes'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'

cask_args appdir: '/Applications'

brew 'ack'
brew 'ansiweather'
brew 'archey'
brew 'bash'
brew 'bash-completion2'
brew 'ccat'
brew 'cheat'
brew 'cmake'
brew 'cookiecutter'
brew 'coreutils'
brew 'ctags'
brew 'dark-mode'
brew 'dfu-util'
brew 'diff-so-fancy'
brew 'doxygen', args: ['with-graphviz', 'with-qt5', 'with-llvm']
brew 'duti'
brew 'ffmpeg', args: ['with-fdk-acc',
                      'with-fontconfig',
                      'with-freetype',
                      'with-libass',
                      'with-librsvg',
                      'with-libvorbis',
                      'with-libvpx',
                      'with-opus',
                      'with-srt',
                      'with-tools',
                      'with-x265',
                      'without-qtkit',
                      'without-xvid']
brew 'findutils'
brew 'gawk'
brew 'gcc', args: ['with-jit']
brew 'gist'
brew 'git', args: ['with-persistent-https',
                   'with-curl',
                   'with-openssl']
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'go'
brew 'graphviz', args:['with-bindings',
                       "with-freetype",
                       "with-librsvg"]
brew 'gzip'
brew 'haskell-stack'
brew 'hdf5'
brew 'howdoi'
brew 'htop', args: ['with-ncurses']
brew 'hub'
brew 'imagemagick', args: ['with-librsvg',
                           'with-fontconfig',
                           'with-fftw',
                           'with-gcc',
                           'with-ghostscript']
brew 'lastpass-cli', args: ['with-pinentry']
brew 'less'
brew 'libsvg'
brew 'make', args: ['with-default-names']
brew 'mas'
brew 'media-info'
brew 'midnight-commander'
brew 'moreutils'
brew 'neovim'
brew 'node'
brew 'openssh'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'phantomjs'
brew 'pkg-config'
brew 'portaudio'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python', args: ['build-from-source']
brew 'r', args: ['with-openblas',
                 'with-java']
brew 'rclone'
brew 'renameutils'
brew 'screenfetch'
brew 'sox'
brew 'ssh-copy-id'
brew 'swiftlint'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux', args: ['with-utf8proc']
brew 'trash'
brew 'wget'
brew 'youtube-dl'
brew 'you-get'
brew 'z'
brew 'zeromq'
brew 'zsh', args: ['with-unicode9'] 
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Dupes
brew 'grep', args: ['with-default-names']
brew 'lsof'
brew 'nano'
brew 'rsync'
brew 'screen'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'whois'

# Casks
cask 'alfred'
cask 'bettertouchtool'
cask 'boostnote'
cask 'caffeine'
cask 'cheatsheet'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'gifox'
cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'haskell-platform'
cask 'iterm2'
cask 'java'
cask 'julia'
cask 'kindle'
cask 'lastpass'
cask "homebrew/cask-drivers/logitech-options"
cask 'lumen'
cask 'mactex'
cask 'mactracker'
cask 'makemkv'
cask 'marshallofsound-google-play-music-player'
cask 'material-colors'
cask 'miniconda'
cask 'monodraw'
cask 'osxfuse'
cask 'plex-media-player'
cask 'pocket-casts'
cask 'powermate'
cask 'pycharm'
cask 'rstudio'
cask 'sequel-pro'
cask 'shades'
cask 'shuttle'
cask 'simplenote'
cask 'skim'
cask 'slack'
cask 'soda-player'
cask 'sourcetree'
cask 'steam'
cask 'sublime-text'
cask 'texstudio'
cask 'the-unarchiver'
cask 'vimr'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
cask "homebrew/cask-drivers/yubico-yubikey-piv-manager"
cask 'zoomus'

# Fonts
cask "homebrew/cask-fonts/font-anonymouspro-nerd-font"
cask "homebrew/cask-fonts/font-anonymouspro-nerd-font-mono"
cask "homebrew/cask-fonts/font-dejavusansmono-nerd-font"
cask "homebrew/cask-fonts/font-dejavusansmono-nerd-font-mono"
cask "homebrew/cask-fonts/font-firacode-nerd-font"
cask "homebrew/cask-fonts/font-firacode-nerd-font-mono"
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "homebrew/cask-fonts/font-hack-nerd-font-mono"
cask "homebrew/cask-fonts/font-inconsolata-nerd-font"
cask "homebrew/cask-fonts/font-inconsolata-nerd-font-mono"
cask "homebrew/cask-fonts/font-meslo-nerd-font"
cask "homebrew/cask-fonts/font-meslo-nerd-font-mono"
cask "homebrew/cask-fonts/font-robotomono-nerd-font"
cask "homebrew/cask-fonts/font-robotomono-nerd-font-mono"
cask "homebrew/cask-fonts/font-sourcecodepro-nerd-font"
cask "homebrew/cask-fonts/font-sourcecodepro-nerd-font-mono"

# QuickLook
cask 'jupyter-notebook-ql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlplayground'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlswift'
cask 'quicklook-csv'
cask 'quicklook-json'


# Mac App Store Installs
mas "Aperture", id: 408981426
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas 'Keynote', id: 409183694
mas 'LastPass', id: 926036361
mas 'Pages', id: 409201541
mas 'ReadKit', id: 588726889
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835

# Have earlier dependencies
brew 'sshfs'
