tap 'homebrew/fuse'
tap 'homebrew/dupes'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'

cask_args appdir: '/Applications'

brew 'ack'
brew 'ansiweather'
brew 'archey'
brew 'bash'
brew 'bash-completion2'
brew 'brightness'
brew 'ccat'
brew 'cheat'
brew 'cmake'
brew 'coreutils'
brew 'dark-mode'
brew 'dfu-util'
brew 'duti'
brew 'findutils'
brew 'gawk'
brew 'gcc', args: ['with-jit']
brew 'gzip'
brew 'hdf5'
brew 'howdoi'
brew 'htop', args: ['with-ncurses']
brew 'lastpass-cli', args: ['with-pinentry']
brew 'less'
brew 'make', args: ['with-default-names']
brew 'mas'
brew 'midnight-commander'
brew 'moreutils'
brew 'mplayer'
brew 'node'
brew 'openssh'
brew 'phantomjs'
brew 'pkg-config'
brew 'rclone'
brew 'renameutils'
brew 'screenfetch'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux', args: ['with-utf8proc']
brew 'trash'
brew 'wget'
brew 'youtube-dl'
brew 'you-get'
brew 'z'
brew 'zeromq'
brew 'zplug'
brew 'zsh', args: ['with-unicode9'] 
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Version Control
brew 'diff-so-fancy'
brew 'gist'
brew 'git', args: ['with-persistent-https',
                   'with-curl',
                   'with-openssl']
brew 'git-extras'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gitup'
brew 'hub'
brew 'bfg'

# Swift
brew 'swiftlint'
brew 'swiftformat'

# Dev
brew 'cookiecutter'
brew 'haskell-stack'
brew 'lua'
brew 'neovim'
brew 'pacvim'
brew 'pre-commit'
brew 'ruby'
brew 'rbenv'
brew 'tox'
brew 'travis'

# Python Specific
brew 'python', args: ['build-from-source']
brew 'pipenv'
brew 'black'
brew 'mypy'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'

# Media 
brew 'media-info'
brew 'mkclean'
brew 'mkvalidator'
brew 'mkvtoolnix'
brew 'portaudio'
brew 'sox'
brew 'fdk-aac-encoder'
brew 'ocrmypdf'

brew 'libcaca', args: ['with-imlib2']
brew 'libvpx', args: ['with-examples',
                      'with-highbitdepth']
brew 'tesseract', args: ['with-opencl',
                         'with-training-tools']
brew 'fftw', args: ['with-mpi',
                    'with-openmp']
brew 'ffmpeg', args: ['with-fdk-aac',  # high-quality audio codec
                      'with-fontconfig',
                      'with-freetype',
                      'with-game-music-emu',  # game music emulation
                      'with-libass',
                      'with-libcaca',   # video to text!
                      'with-librsvg',
                      'with-libsoxr',
                      'with-libvidstab',  # video stabilization
                      'with-libvorbis',
                      'with-libvpx',
                      'with-opus',  # high compression audio
                      'with-rubberband',  # time-stretching and pitch shifting
                      'with-sdl2',  # ffplay
                      'with-srt',  # srt subtitle support
                      'with-tesseract',  # allows OCR
                      'with-tools',
                      'with-wavpack',  # lossless audio compression
                      'with-webp',  # google image format
                      'with-x265',  # high compression video
                      'with-zeromq',
                      'without-qtkit',
                      'without-xvid']

brew 'imagemagick', args: ['with-fftw',
                           'with-fontconfig',
                           'with-ghostscript',
                           'with-librsvg',
                           'with-webp']

brew 'graphviz', args:['with-bindings',
                       "with-freetype",
                       "with-librsvg"]

# Documents
brew 'pandoc'
brew 'pandoc-citeproc'

# Dupes
brew 'grep', args: ['with-default-names']
brew 'lsof'
brew 'nano'
brew 'rsync'
brew 'screen'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'whois'

# Casks
cask 'alfred'
cask 'bettertouchtool'
cask 'boostnote'
cask 'caffeine'
cask 'cheatsheet'
cask 'colloquy'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'git-it'
cask 'gitkraken'
cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'inkscape'
cask 'iterm2'
cask 'java'
cask 'julia'
cask 'kindle'
cask 'lastpass'
cask 'lumen'
cask 'mactex'
cask 'mactracker'
cask 'makemkv'
cask 'marshallofsound-google-play-music-player'
cask 'material-colors'
cask 'meld'  # git merge tool
cask 'mkvtools'
cask 'netspot'
cask 'osxfuse'
cask 'plex-media-player'
cask 'pocket-casts'
cask 'powermate'
cask 'pycharm'
cask 'r-app'
cask 'rstudio-preview'
cask 'sequel-pro'
cask 'shades'
cask 'shuttle'
cask 'simplenote'
cask 'skim'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'sublime-text'
cask 'texstudio'
cask 'the-unarchiver'
cask 'vimr'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
cask "yubico-yubikey-piv-manager"
cask 'zoomus'

# Fonts
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-dejavusansmono-nerd-font"
cask "font-dejavusansmono-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "font-robotomono-nerd-font"
cask "font-robotomono-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"

# QuickLook
cask 'jupyter-notebook-ql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlplayground'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlswift'
cask 'quicklook-csv'
cask 'quicklook-json'

# Mac App Store Installs
mas 'Keynote', id: 409183694
mas 'LastPass', id: 926036361
mas 'Pages', id: 409201541
mas 'ReadKit', id: 588726889
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835

# Have earlier dependencies
brew 'sshfs'
