tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'

cask_args appdir: '/Applications'

brew 'mas'
cask 'xquartz'
mas 'Xcode', id: 497799835
cask 'java'

brew 'ack'
brew 'archey'
brew 'brightness'
brew 'ccat'
brew 'cheat'
brew 'cmake'
brew 'coreutils'
brew 'dfu-util'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gzip'
brew 'hdf5'
brew 'howdoi'
brew 'htop'
brew 'iperf3'
brew 'ipmitool'
brew 'ipmiutil'
brew 'less'
brew 'make'
brew 'midnight-commander'
brew 'moreutils'
brew 'mplayer'
brew "mtr"
brew "nmap"
brew 'node'
brew 'openssh'
brew 'p7zip'
brew 'pkg-config'
brew 'pulseaudio'
brew "qt"
brew 'rclone'
brew 'renameutils'
brew 'screenfetch'
brew 'ssh-copy-id'
brew "tcl-tk"
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew "tldr"
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'youtube-dl'
brew 'you-get'
brew 'z'
brew 'zeromq'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Version Control
brew 'diff-so-fancy'
brew 'gist'
brew 'git'
brew 'git-extras'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gitup'
brew 'hub'
brew 'bfg'

# Swift
brew 'swiftlint'
brew 'swiftformat'

# Dev
brew 'cookiecutter'
brew "direnv"
brew 'haskell-stack'
brew 'highlight'
brew 'lua'
brew 'neovim'
brew 'pacvim'
brew 'pre-commit'
brew 'ruby'
brew 'rbenv'
brew 'source-highlight'

# Python Specific
brew 'python'
brew 'flake8'
brew 'black'
brew 'sphinx-doc'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-which-ext', args: ['HEAD']
brew 'pipx'

# Media 
brew 'media-info'
brew 'mkclean'
brew 'mkvalidator'
brew 'mkvtoolnix'
brew 'portaudio'
brew 'sox'
brew 'fdk-aac-encoder'
brew 'ocrmypdf'

brew 'ffmpeg'
brew 'imagemagick'
brew 'graphviz'

# Documents
brew 'pandoc'
brew 'pandoc-citeproc'

# Dupes
brew 'grep'
brew 'lsof'
brew 'nano'
brew 'rsync'
brew 'screen'
brew 'gnu-sed'
brew 'gnu-units'
brew 'whois'

# Casks
cask 'aerial'
cask 'alfred'
cask 'authy'
cask 'balenaetcher'
cask 'bettertouchtool'
cask 'boostnote'
cask 'caffeine'
cask 'cheatsheet'
cask 'colloquy'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'dbeaver-community'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'filebot'
cask 'git-it'
cask 'gitkraken'
cask 'google-chat'
cask 'google-chrome'
cask 'hex-fiend'
cask 'inkscape'
cask 'iterm2'
cask 'julia'
cask 'kindle'
cask 'kodi'
cask 'lumen'
cask 'mactex'
cask 'mactracker'
cask 'makemkv'
cask 'marshallofsound-google-play-music-player'
cask 'material-colors'
cask 'meld'  # git merge tool
cask 'mkvtools'
cask 'monitorcontrol'
cask 'netspot'
cask 'nightowl'
cask 'nvidia-geforce-now'
cask 'parsec'
cask 'phantomjs'
cask 'plex'
cask 'pocket-casts'
cask 'pycharm'
cask 'pycharm-ce'
cask 'r-app'
cask 'rstudio'
cask 'shades'
cask 'shuttle'
cask 'simplenote'
cask 'skim'
cask 'slack'
cask 'sourcetree'
cask 'splashtop-personal'
cask 'steam'
cask 'sublime-text'
cask 'texstudio'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'vimr'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xbox360-controller-driver-unofficial'
cask "yubico-yubikey-piv-manager"
cask 'zoomus'

# Fonts
cask "font-3270-nerd-font"
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-aurulentsansmono-nerd-font"
cask "font-bitstreamverasansmono-nerd-font"
cask "font-dejavusansmono-nerd-font"
cask "font-dejavusansmono-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask 'font-jetbrainsmono-nerd-font'
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "font-robotomono-nerd-font"
cask "font-robotomono-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"

# QuickLook
cask 'jupyter-notebook-ql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlplayground'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlswift'
cask 'quicklook-csv'
cask 'quicklook-json'

# Mac App Store Installs
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'ReadKit', id: 588726889
mas 'Transmit', id: 403388562
mas 'Tweetbot', id: 557168941
