# Install command line apps

brew 'ack'
brew 'archey'
brew 'bash'
brew 'ccat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'duti'
brew 'ffmpeg'
brew 'findutils'
brew 'gcc'
brew 'git'
brew 'git-extras'
brew 'gist'
brew 'graphviz'
brew 'htop'
brew 'hub'
brew 'lastpass-cli'
brew 'media-info'
brew 'moretools'
brew 'moreutils'
brew 'multimarkdown'
brew 'node'
brew 'pandoc'
brew 'pkg-config'
brew 'ssh-copy-id'
brew 'termianal-notifier'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim', args: ['override-system-vi']
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zeromq'
# For Bash or Zsh, put something like this in your $HOME/.bashrc or $HOME/.zshrc:
#   . `brew --prefix`/etc/profile.d/z.sh
brew 'zsh'


brew 'caskroom/cask/brew-cask'
tap 'homebrew/science'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'atom'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cheatsheet'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'hotkeyeve'
cask 'iterm2-beta'
cask 'kindle'
cask 'macdown'
cask 'mactex'
cask 'material-colors'
cask 'monodraw'
cask 'plex-media-player'
cask 'rstudio'
cask 'sidestep'
cask 'skim'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'steam'
cask 'sublime-text3'
cask 'texstudio'
cask 'trim-enabler'
cask 'the-unarchiver'
cask 'vlc'

# Fonts
cask 'font-dejavu-sans'
cask 'font-source-code-pro'
cask 'font-hack'

# QuickLook
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'qlprettypatch'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'quickook-json'
